package com.sjl.bookmark.entity.zhuishu;

/**
 * TODO
 *
 * @author Kelly
 * @version 1.0.0
 * @filename ChapterInfoDto2.java
 * @time 2019/7/26 15:33
 * @copyright(C) 2019 song
 */
public class ChapterInfoDto2 {

    /**
     * ok : true
     * chapter : {"title":"正文 第十章","body":" 请安装最新版追书 以便使用优质资源","isVip":false,"order":11,"currency":10,"id":"574c112661df20b32c5f7cfd","created":"2016-05-30T10:08:38.908Z","updated":"2018-09-29T00:46:33.804Z","cpContent":" 近来几日，凤凰似乎心情不大爽利，特别是见着我的时候，那眼神分明书着\u201c厌烦\u201d两个大字，还是闷骚的楷体。是以，我揣摩了一下，太半是嫉妒了。 凤凰那皮相冠盖六界冠了这万把年，大约十分习惯了千人仰慕万人倾倒，现如今竟有个月孛星使漏网没被他迷了去，反而看上我，自然叫他心里不舒坦得很。 我想了想，本着作一个低调而又有境界的果子，便决定将那\u201c锁灵簪\u201d给收了，别了段葡萄藤变换的簪子，现出真身，莫叫人再错认成男神仙，免得再撞上个把像月孛这样的小仙姑迷上我，少不得凤凰的自尊心再受一次捶打。 我别着葡萄藤日日进出栖梧宫，凤凰那厮面色却益发不济，连带着栖梧宫的仙娥姐姐们面色也不好起来，只有小仙侍们见着我总红润着脸显出几分朱雀卵的喜庆。 今日来洗尘殿扫尘的仙娥姐姐端详了我半晌，郑重其事道：\u201c锦觅，你长得果然招蜂引蝶。\u201d 哎？这话听着有些奇怪，我们做花草果蔬的自然要招蜂引蝶，不然这花粉没个蜂儿蝶儿授上一授，怎结得出果子？没有果子，又哪里来的葡萄？ 是以，我便坦然应道：\u201c呵呵，这是我的本分，应该的，应该的。\u201d 仙娥姐姐愣在那里，边上飞絮狠狠咳了一下，\u201c锦觅，缺心眼不是你的错，只是缺心眼又长得这般模样，实是愧对你这副好皮囊。\u201d 正待开口，却听身后有人轻轻一笑，仙娥姐姐和飞絮突然站了起来，规规矩矩立在一旁，我回头一看，原来是凤凰不知道什么时候回来了，正在我身后站着。 我瞧了瞧，这厮今日面色倒还好，嘴角笑涡浅浅隐匿，他亦睨了我一眼，云淡风轻地拂了拂袖道：\u201c都下去吧。\u201d \u201c是。\u201d飞絮和仙娥姐姐躬身退下。 我便也跟着往外走，凤凰却拦了我，\u201c你走了，却叫哪个来磨墨？\u201d 我撇了撇嘴，取了香墨兑上水磨墨，一边凤凰执了笔刷刷刷便开始埋头公文，突然头也不抬与我道：\u201c还是将那锁灵簪别上吧。\u201d \u201c嗳？\u201d这又是唱的哪出？ 他却眉间一蹙，勾起长长的眼尾望向我，\u201c怎的？不愿意？\u201d 这厮压人一头的气势果然有些骇人，我赶忙道：\u201c我真的不是故意要长得比你好看，全然巧合、巧合。\u201d 凤凰一楞，旋即哑然失笑，抬手在我额际弹了一下，\u201c你呀\u2026\u2026没心没肺\u2026\u2026\u201d 果然是喜怒无常的鸟儿。 \u201c这是叔父托我给你的拜帖。\u201d他从袖袋中抽出张红艳艳的帖子递与我。 我接过帖子看了看，是狐狸仙约我明日巳时去姻缘府喝茶听戏的拜帖。 诚然，此番计都星君上门提亲这样的事情忽忽悠悠恨不得传遍每个犄角旮旯，狐狸仙这样热闹的性子想必一早便知晓了，忍到今日才有所动作我以为已然十分不易，只是平日里狐狸仙但凡遇着点什么乐事总是直接扑上洗尘殿来寻我，或是直接让小仙侍传个话让我过姻缘府，怎的今日这般讲究起来。 想问凤凰，奈何那厮已然一副忙碌样子，便也不好去讨没趣，罢了。 第二日，我揣了块洗尘殿的一品碧黛香墨做手信前去姻缘府，天边刚淋过一场淅沥小雨，栖梧宫外悬挂起一道七彩斑斓的虹桥，所谓天色正好。 我本就不喜腾云驾雾，此番见着如此光景，心情不禁欢快起来，便徒步踱上那彩虹，顺道看看风景。却忘了但凡好看的物什多半只可远远观观，近前去多半不靠谱，譬如此番这虹桥，远看着七彩迷离煞是好看，踱上去才发现滑溜得很，一个没有站稳，我便哧溜溜从这头滑到了那头。 彩虹尽头，我几分狼狈站起身来，尚未来得及整饬好衣摆就被眼前景致所惑。 寂寂无声中，一片墨绿得几近发黑的茂盛林子裹着一潭汤药般泛着苦涩深褐的湖水，微微起澜。潭边一群梅花鹿或坐或卧，姿态闲暇，其中一只机敏的小鹿想是听见响声，耳朵动了动两只圆溜溜的眼睛转向我，大抵觉着我面色和善无甚歹意便又转了回去。 它这一转动的间隙，我瞅见了一条鱼尾巴，一条岸上的鱼尾巴，唔，怎的现今鱼儿都被逼得上岸了？这是一个怎样令人痛心疾首的环境恶化现象呀。 我近前去探头一看，却瞧见一尾鱼，差矣，是瞧见一个人，似乎也不太对。是一个下半身是条月华粼粼的鱼尾，上半身却是人形的白衣少年阖眼枕着一只梅花鹿的腹部香甜入梦。 不过一眼，那人却已醒转，一双眼睛迷迷澄澄将我一望。 我指了指他的鱼尾，兴奋道：\u201c真是一条无与伦比的尾巴呀！\u201d 那人亦看了看自己的尾巴，道：\u201c一般、一般。\u201d态度谦和。 四周的梅花鹿见他醒转，立刻乖巧地停了动作一头两头靠将过来。如此光景，我晓得了，这人太半是个放鹿的仙倌。 眨眼间，那条银白珠光的大鱼尾却不知何时化作了两条腿，但见放鹿的仙倌慵懒地整了整衣襟站起身来，适才躺着倒没观出来，这番一站我发现这仙倌竟和凤凰差不多高。 我仰头与他道：\u201c仙倌这鹿放得甚好，膘肥体壮。只是不知都送往哪家仙宫的膳房？\u201d 那仙倌定了定，\u201c放鹿？膳房？\u201d神色间颇有些郁结。 我一惊，莫不是触到他痛处了？天界的神仙品阶森严，有颇多讲究，放牧的小鱼仙倌想来是个不高的阶位，此番被我直接呼出来想是面上无光。譬如凡间做官的，上至宰相下至九品，相互间见着都必定要拱拱手谦虚唤对方一句\u201c某某大人\u201d，不分高低，好叫品阶低的小官也不至尴尬。 此番是我大意了，赶忙补救道：\u201c呵呵，上仙这职务甚是有前途，遥想当年齐天大圣孙悟空便是从弼马温这样的畜牧行当中脱颖而出，后来西天取经何其风光，听说佛祖还封了\u2018斗战圣佛\u2019。嗯，还有八仙张果老儿，好像成仙前也放过驴的，如今不也体面光耀得紧。是以，锦觅料想上仙前途不可限量！\u201d 那仙倌低头沉思片刻，旋即粲然一笑：\u201c仙子一番推衍，委实令在下茅塞顿开、豁然开朗。多谢多谢。\u201d 我慨然一拱手，潇洒回道：\u201c上仙客气了。\u201d \u201c小仙表字润玉，不知仙子如何称呼？\u201d小鱼仙倌笑意嫣然。 \u201c在下锦觅。\u201d我一扬手，袖袋里的碧黛香墨一个不留神滑了出来，我一拍脑门，方才记起狐狸仙的邀约，此番一耽搁，莫要误了时辰才好。 我急急拾起香墨与小鱼仙倌道别，战战兢兢过了那滑溜的虹桥，踏云往姻缘府去。"}
     */

    private boolean ok;
    private ChapterBean chapter;

    public boolean isOk() {
        return ok;
    }

    public void setOk(boolean ok) {
        this.ok = ok;
    }

    public ChapterBean getChapter() {
        return chapter;
    }

    public void setChapter(ChapterBean chapter) {
        this.chapter = chapter;
    }

    public static class ChapterBean {
        /**
         * title : 正文 第十章
         * body :  请安装最新版追书 以便使用优质资源
         * isVip : false
         * order : 11
         * currency : 10
         * id : 574c112661df20b32c5f7cfd
         * created : 2016-05-30T10:08:38.908Z
         * updated : 2018-09-29T00:46:33.804Z
         * cpContent :  近来几日，凤凰似乎心情不大爽利，特别是见着我的时候，那眼神分明书着“厌烦”两个大字，还是闷骚的楷体。是以，我揣摩了一下，太半是嫉妒了。 凤凰那皮相冠盖六界冠了这万把年，大约十分习惯了千人仰慕万人倾倒，现如今竟有个月孛星使漏网没被他迷了去，反而看上我，自然叫他心里不舒坦得很。 我想了想，本着作一个低调而又有境界的果子，便决定将那“锁灵簪”给收了，别了段葡萄藤变换的簪子，现出真身，莫叫人再错认成男神仙，免得再撞上个把像月孛这样的小仙姑迷上我，少不得凤凰的自尊心再受一次捶打。 我别着葡萄藤日日进出栖梧宫，凤凰那厮面色却益发不济，连带着栖梧宫的仙娥姐姐们面色也不好起来，只有小仙侍们见着我总红润着脸显出几分朱雀卵的喜庆。 今日来洗尘殿扫尘的仙娥姐姐端详了我半晌，郑重其事道：“锦觅，你长得果然招蜂引蝶。” 哎？这话听着有些奇怪，我们做花草果蔬的自然要招蜂引蝶，不然这花粉没个蜂儿蝶儿授上一授，怎结得出果子？没有果子，又哪里来的葡萄？ 是以，我便坦然应道：“呵呵，这是我的本分，应该的，应该的。” 仙娥姐姐愣在那里，边上飞絮狠狠咳了一下，“锦觅，缺心眼不是你的错，只是缺心眼又长得这般模样，实是愧对你这副好皮囊。” 正待开口，却听身后有人轻轻一笑，仙娥姐姐和飞絮突然站了起来，规规矩矩立在一旁，我回头一看，原来是凤凰不知道什么时候回来了，正在我身后站着。 我瞧了瞧，这厮今日面色倒还好，嘴角笑涡浅浅隐匿，他亦睨了我一眼，云淡风轻地拂了拂袖道：“都下去吧。” “是。”飞絮和仙娥姐姐躬身退下。 我便也跟着往外走，凤凰却拦了我，“你走了，却叫哪个来磨墨？” 我撇了撇嘴，取了香墨兑上水磨墨，一边凤凰执了笔刷刷刷便开始埋头公文，突然头也不抬与我道：“还是将那锁灵簪别上吧。” “嗳？”这又是唱的哪出？ 他却眉间一蹙，勾起长长的眼尾望向我，“怎的？不愿意？” 这厮压人一头的气势果然有些骇人，我赶忙道：“我真的不是故意要长得比你好看，全然巧合、巧合。” 凤凰一楞，旋即哑然失笑，抬手在我额际弹了一下，“你呀……没心没肺……” 果然是喜怒无常的鸟儿。 “这是叔父托我给你的拜帖。”他从袖袋中抽出张红艳艳的帖子递与我。 我接过帖子看了看，是狐狸仙约我明日巳时去姻缘府喝茶听戏的拜帖。 诚然，此番计都星君上门提亲这样的事情忽忽悠悠恨不得传遍每个犄角旮旯，狐狸仙这样热闹的性子想必一早便知晓了，忍到今日才有所动作我以为已然十分不易，只是平日里狐狸仙但凡遇着点什么乐事总是直接扑上洗尘殿来寻我，或是直接让小仙侍传个话让我过姻缘府，怎的今日这般讲究起来。 想问凤凰，奈何那厮已然一副忙碌样子，便也不好去讨没趣，罢了。 第二日，我揣了块洗尘殿的一品碧黛香墨做手信前去姻缘府，天边刚淋过一场淅沥小雨，栖梧宫外悬挂起一道七彩斑斓的虹桥，所谓天色正好。 我本就不喜腾云驾雾，此番见着如此光景，心情不禁欢快起来，便徒步踱上那彩虹，顺道看看风景。却忘了但凡好看的物什多半只可远远观观，近前去多半不靠谱，譬如此番这虹桥，远看着七彩迷离煞是好看，踱上去才发现滑溜得很，一个没有站稳，我便哧溜溜从这头滑到了那头。 彩虹尽头，我几分狼狈站起身来，尚未来得及整饬好衣摆就被眼前景致所惑。 寂寂无声中，一片墨绿得几近发黑的茂盛林子裹着一潭汤药般泛着苦涩深褐的湖水，微微起澜。潭边一群梅花鹿或坐或卧，姿态闲暇，其中一只机敏的小鹿想是听见响声，耳朵动了动两只圆溜溜的眼睛转向我，大抵觉着我面色和善无甚歹意便又转了回去。 它这一转动的间隙，我瞅见了一条鱼尾巴，一条岸上的鱼尾巴，唔，怎的现今鱼儿都被逼得上岸了？这是一个怎样令人痛心疾首的环境恶化现象呀。 我近前去探头一看，却瞧见一尾鱼，差矣，是瞧见一个人，似乎也不太对。是一个下半身是条月华粼粼的鱼尾，上半身却是人形的白衣少年阖眼枕着一只梅花鹿的腹部香甜入梦。 不过一眼，那人却已醒转，一双眼睛迷迷澄澄将我一望。 我指了指他的鱼尾，兴奋道：“真是一条无与伦比的尾巴呀！” 那人亦看了看自己的尾巴，道：“一般、一般。”态度谦和。 四周的梅花鹿见他醒转，立刻乖巧地停了动作一头两头靠将过来。如此光景，我晓得了，这人太半是个放鹿的仙倌。 眨眼间，那条银白珠光的大鱼尾却不知何时化作了两条腿，但见放鹿的仙倌慵懒地整了整衣襟站起身来，适才躺着倒没观出来，这番一站我发现这仙倌竟和凤凰差不多高。 我仰头与他道：“仙倌这鹿放得甚好，膘肥体壮。只是不知都送往哪家仙宫的膳房？” 那仙倌定了定，“放鹿？膳房？”神色间颇有些郁结。 我一惊，莫不是触到他痛处了？天界的神仙品阶森严，有颇多讲究，放牧的小鱼仙倌想来是个不高的阶位，此番被我直接呼出来想是面上无光。譬如凡间做官的，上至宰相下至九品，相互间见着都必定要拱拱手谦虚唤对方一句“某某大人”，不分高低，好叫品阶低的小官也不至尴尬。 此番是我大意了，赶忙补救道：“呵呵，上仙这职务甚是有前途，遥想当年齐天大圣孙悟空便是从弼马温这样的畜牧行当中脱颖而出，后来西天取经何其风光，听说佛祖还封了‘斗战圣佛’。嗯，还有八仙张果老儿，好像成仙前也放过驴的，如今不也体面光耀得紧。是以，锦觅料想上仙前途不可限量！” 那仙倌低头沉思片刻，旋即粲然一笑：“仙子一番推衍，委实令在下茅塞顿开、豁然开朗。多谢多谢。” 我慨然一拱手，潇洒回道：“上仙客气了。” “小仙表字润玉，不知仙子如何称呼？”小鱼仙倌笑意嫣然。 “在下锦觅。”我一扬手，袖袋里的碧黛香墨一个不留神滑了出来，我一拍脑门，方才记起狐狸仙的邀约，此番一耽搁，莫要误了时辰才好。 我急急拾起香墨与小鱼仙倌道别，战战兢兢过了那滑溜的虹桥，踏云往姻缘府去。
         */

        private String title;
        private String body;
        private boolean isVip;
        private int order;
        private int currency;
        private String id;
        private String created;
        private String updated;
        private String cpContent;

        public String getTitle() {
            return title;
        }

        public void setTitle(String title) {
            this.title = title;
        }

        public String getBody() {
            return body;
        }

        public void setBody(String body) {
            this.body = body;
        }

        public boolean isIsVip() {
            return isVip;
        }

        public void setIsVip(boolean isVip) {
            this.isVip = isVip;
        }

        public int getOrder() {
            return order;
        }

        public void setOrder(int order) {
            this.order = order;
        }

        public int getCurrency() {
            return currency;
        }

        public void setCurrency(int currency) {
            this.currency = currency;
        }

        public String getId() {
            return id;
        }

        public void setId(String id) {
            this.id = id;
        }

        public String getCreated() {
            return created;
        }

        public void setCreated(String created) {
            this.created = created;
        }

        public String getUpdated() {
            return updated;
        }

        public void setUpdated(String updated) {
            this.updated = updated;
        }

        public String getCpContent() {
            return cpContent;
        }

        public void setCpContent(String cpContent) {
            this.cpContent = cpContent;
        }
    }
}

